# Операторы и операнды.
# Унарные Операторы - необходимо одно значениие для выполнения действия (унарный минус).
# Бинарные Операторы - необходимы два значениие для выполнения действия.
# Тернарные Операторы- возвращают свой второй или третий операнд в
# зависимости от значения логического выражения, заданного первым операндом.
# ОПЕРАТОРЫ СРАВНЕНИЯ. Результат всегды булево значение.
print(10 < 5)
print(10 > 5)
print(10 <= 5)
print(10 >= 5)
print(10 <= (5 * 2))
print(3 == 5)
print(3 != 5)
print('-' * 50)

# ПОБИТОВЫЕ ЛОГИЧЕСКИЕ ОПЕРАТОРЫ (работают непосредственно с битами).
# Большинство битовых операций являются операциями составного присваивания.
# -x 	Побитовое «НЕ»
# | 	Побитовое «ИЛИ» Двоичный разряд результата равен 0 только тогда, когда оба соответствующих бита в равны 0.
# # Во всех других случаях двоичный результат равен 1.
# ^ 	Побитовое «ИСКЛЮЧИТЕЛЬНОЕ ИЛИ»
# & 	Побитовое «И». Двоичный разряд результата равен 1 только тогда, когда оба соответствующих бита операндов равны 1.
print(0 & 1)


